# GetDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentChangedEventArgs..::..GetDocument Method
DocumentChangedEventArgs Class See Also
---
Returns document associated with this event
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Document GetDocument()
```

Visual Basic
---
```text
Public Function GetDocument As Document
```

Visual C++
---
```text
public:
Document^ GetDocument()
```

# ### Return Value
The document associated with this event.
# See Also
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace